Gimmik5/ClearSky/esp32/globals.h
/*
 * Global Variables and Function Declarations
 * Shared across all module files
 */

#ifndef GLOBALS_H
#define GLOBALS_H

#include "esp_camera.h"
#include "WiFi.h"
#include "HTTPClient.h"
#include "ESP32_Config.h"

// ===== GLOBAL VARIABLES =====
extern bool systemPaused;
extern unsigned long lastCaptureTime;
extern int captureInterval;
extern int uploadFailCount;

// ===== FUNCTION DECLARATIONS =====

// System initialization (defined in system_init.ino)
void initSystem();
void initLED();
void initWatchdog();
void printStartupInfo();

// Camera functions (defined in camera_module.ino)
bool initCamera();
bool configureCameraSettings(camera_config_t* config);
bool configureCameraSensor();
void printCameraInfo();
camera_fb_t* captureImage();
camera_fb_t* captureImageWithRetry();

// WiFi functions (defined in wifi_module.ino)
bool initWiFi();
bool connectToWiFi();
bool checkWiFiConnection();
void reconnectWiFi();
void printWiFiInfo();

// Upload functions (defined in upload_module.ino)
void captureAndSend();
bool uploadImage(camera_fb_t* fb);
bool sendHTTPRequest(HTTPClient* http, camera_fb_t* fb);
void handleUploadSuccess(String response);
void handleUploadFailure(int httpCode);

// Serial command functions (defined in serial_commands.ino)
void checkSerialCommands();
void handlePauseCommand();
void handleResumeCommand();
void handleCaptureCommand();
void handleIntervalCommand(String cmd);
void handleStatusCommand();
void printCommandHelp();
void printStatus();

// LED functions (defined in led_module.ino)
void blinkLED(int times);
void blinkSuccess();
void blinkError();
void blinkCapture();

// Utility functions (defined in utils.ino)
void debugPrint(const char* message);
void debugPrintf(const char* format, ...);

// SD Card functions (defined in sd_card_module.ino)
bool initSDCard();
bool saveImageToSD(camera_fb_t* fb, const char* filename);
String generateImageFilename();
bool logCaptureToSD(const char* timestamp, size_t imageSize, bool uploadSuccess);
void cleanupOldImages();
void printSDStatus();
void listSDFiles();
bool sdIsAvailable();
int sdGetImageCount();
uint64_t sdGetFreeSpace();

#endif // GLOBALS_H
